<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <title>10 Formas de Aprender Javascript - Programando.la</title>
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="description" content="Aprender programacion gratis por que aqui SI estamos mejorandola.">
    <meta name="author" content="Ivan castellanos">
    <meta name="twitter" content="ivanca">
    <link href="css/bootstrap.min.css?nocahe=2" rel="stylesheet" type="text/css" />    
    <link href="css/bootstrap-responsive.css?nocahe=2" rel="stylesheet" type="text/css" />
    <!--[if lt IE 9]>
      <script src="http://html5shim.googlecode.com/svn/trunk/html5.js"></script>
    <![endif]-->
    <link rel="shortcut icon" href="favicon.ico">
    <link rel="apple-touch-icon-precomposed" sizes="144x144" href="../assets/ico/apple-touch-icon-144-precomposed.png">
    <link rel="apple-touch-icon-precomposed" sizes="114x114" href="../assets/ico/apple-touch-icon-114-precomposed.png">
    <link rel="apple-touch-icon-precomposed" sizes="72x72" href="../assets/ico/apple-touch-icon-72-precomposed.png">
    <link rel="apple-touch-icon-precomposed" href="../assets/ico/apple-touch-icon-57-precomposed.png">
    <style type="text/css">

    .container {
      margin-top: 60px;
    }


    h1, h2, h3, h4, p, .mini {
      margin-left: 40px;
      margin-right: 40px;
    }

    a {
      color: #7CB600;
      font-weight: bold;
    }

    h1 {
      margin-top: 35px;
      margin-bottom: 10px;
      line-height: 66px;
      font-size: 52px;
    }

    .p {
      text-align: justify;
      line-height: 23px;
      font-size: 13px;
      padding-right: 20px;
    }

    h2 {
    margin-top: 60px;
    font-size: 26px;
    padding: 10px;
    border-radius: 10px;
    background: rgb(162, 201, 41);
    padding-left: 35px;
    margin-left: 0px;
    border-top-left-radius: 0;
    border-bottom-left-radius: 0;
    margin-bottom: 30px;
    clear: both;
    text-shadow: 1px 1px 2px rgb(43, 66, 27);

    color: white;
    }

    .mini {
      border: 1px solid white;
      box-shadow: 3px 3px 8px rgb(190, 190, 190);
      border-radius: 50px;
      float: left;
    }

    .home {
      position: absolute;
      top: -51px;
      left: 40px;
      cursor: pointer;
      overflow: hidden;
      width: 62px;
    }

    .home img {
      box-shadow: 3px 3px 2px rgba(0, 0, 0, 0.2);
      border-radius: 7px;
      border-bottom-left-radius: 0;
      border-bottom-right-radius: 0;
    }

    .home img:hover {
      box-shadow: 0px 3px 2px rgba(-1, 0, 0, 0.4);
      margin-left: 2px;
    }

    h3 {
      clear: left;
      float: left;
      padding-bottom: 10px;
      color: #CCC;
      width: 182px;
      height: 40px;
      font-size: 20px;
      text-align: center;
      margin: 0;
    }

    .qtip-title {
      color: #AAA;
      font-weight: bold;
    }

    @media (max-width: 767px) {
      .home img, .home img:hover {
        border-radius: 7px;
        box-shadow: none;
        margin-left: 0;
      }

      .home {
        overflow: visible;
        padding-top: 10px;
        top: -60px;
        padding-bottom: 10px;
        width: 100%;
        border-radius: 8px;
        text-align: center;
        left: 0;
        background: rgb(170, 204, 62);
        border-top-left-radius: 0;
        border-top-right-radius: 0;
      }
    }
    </style>
  </head>

  <body class="nojs">

    <script>document.body && (document.body.className = "");</script>

    <div class="alert-message info hide">
        <a class="close" href="#">×</a>
        <p></p>
    </div>
    <script>
    var msg = decodeURIComponent(document.cookie).match(/message=[^@;]+/);
    if(msg) {
      msg = msg ? msg[0].replace("message=", "").replace(/\+/g, ' ') : '';
      document.getElementsByTagName("div")[0].className += 'no';
      document.getElementsByTagName("p")[0].innerHTML = msg || 'Operacion realizada con satisfaccion!';
      document.cookie = "message=@;";
    }
    </script>

    <div class="container">

      <a class="home" href="./" title="Ir al directorio!"><img role="presentation" aria-hidden="true" src="img/return_btn.png" alt="icon"></a>
      <h1>10 Formas Mejores De Aprender Javascript Sin Pagar Un Peso!</h1>

      <a target="_blank" href="http://www.codecademy.com/?locale_code=es#!/exercises/0">
        <h2>Interactivamente en CodeCademy... en espa&ntilde;ol!</h2>
      </a>
      <img class="mini" src="img/mini_cc.jpg" />
      <h3>Precio: <span>$0</span></h3>
      <p class="p">En los <a target="_blank"  href="http://www.codecademy.com/?locale_code=es#!/exercises/0">ejercicios interactivos de CodeCademy</a> podr&aacute;s aprender de una forma muy sencilla e interactiva que es Javascript, como se compone y como usarlo para crear lo que tu necesitas. La aplicaci&oacute;n en los primeros niveles te dice exactamente que es lo que tienes que escribir, lentamente te va dando mas libertad estimulando tu l&oacute;gica y razonamiento para que eventualmente seas capaz de resolver sin ayuda cualquier problema que te pida solucionar.</p>
      

      <a target="_blank" href="http://www.youtube.com/playlist?list=PL9ADAF257242D75FA">
        <h2>Viendo los v&iacute;deos de C&oacute;digo Facilito</h2>
      </a>
      <img class="mini" src="img/mini_cf.jpg" />
      <h3>Precio: <span>$0</span></h3>
      <p class="p">En los <a target="_blank"  href="http://www.youtube.com/playlist?list=PL9ADAF257242D75FA">v&iacute;deos de Javascript de c&oacute;digo facilito</a> podr&aacute; encontrar todo lo que necesita saber sobre Javascript y jQuery para poder hacer interesantes efectos y funcionalidades en su pagina web con todas las ventajas que los videotutoriales dan; tales como pausar para continuar otro d&iacute;a, repetir cualquier parte que no entienda, <a target="_blank" href="http://keepvid.com/">descargarlo</a> para poder verlos desde su smartphone. Igualmente es excelente para principiantes que familiarizarse con la sintaxis de Javascript la cual cada d&iacute;a coge mas fuerza en otros ambientes tales como en aplicaciones multi-plataforma como Node.JS y Phantom.JS e incluso interfaces para aplicaciones desktop en Windows 8. No esta dem&aacute;s mencionar que CodigoFacilito tambi&eacute;n ofrece v&iacute;deos para <a target="_blank" href="http://www.youtube.com/user/codigofacilito/videos?view=1&flow=grid">muchos otros lenguajes de programaci&oacute;n y nuevas tecnolog&iacute;as</a>.</p>
      
      <a target="_blank" href="http://www.criteriastudio.com/javascript-para-titanium-i/">
        <h2>Leyendo los tutoriales de Titanium creados por Criteria</h2>
      </a>
      <img class="mini" src="img/mini_titanium.jpg" />
      <h3>Precio: <span>$0</span></h3>
      <p class="p"><a href="http://www.criteriastudio.com/javascript-para-titanium-i/">Los tutoriales de Criteria</a> ense&ntilde;an Titanium. Esta es una plataforma para desarrollar aplicaciones que se crean una sola vez en Javascript pero sirven de base para crear aplicaciones nativas (osea muy r&aacute;pidas!) que corran nativamente en todos los dispositivos modernos: iPhone, iPads, Android y mas! Es por eso que es un excelente alternativa para mejorar tus habilidades en Javascript mientras construyes aplicaciones multi-dispositivo para ti o para tu empresa.</p> 
 
      <a target="_blank" href="http://www.youtube.com/playlist?list=PLA2F1E4E7EB7FB461">
        <h2>Videotutoriales de Unity para crear videojuegos!</h2>
      </a>
      <img class="mini" src="img/mini_fenix.jpg" />
      <h3>Precio: <span>$0</span></h3>
      <p class="p">En los <a target="_blank"  href="http://www.youtube.com/playlist?list=PLA2F1E4E7EB7FB461">v&iacute;deos de Javascript de Fenix Discom</a> aprenderas como crear Javascript para Unity; un software que te permite crear videojuegos instalables y para la web (usando un plugin). Unity es una plataforma cada vez mas fuerte y conocida por que facilita much&iacute;simo la creaci&oacute;n de videojuegos 3D y 2D. <a target="_blank" href="http://unity3d.com/">La pagina oficial</a> esta en ingles pero tiene mucha info que te podr&iacute;a interesar. Aunque si le tienes fobia al ingles trinit.es nos ofrece gratuitamente <a href="http://trinit.es/unity/tutoriales/" target="_blank">muchos documentos en espa&ntilde;ol para aprender</a> sobre esta interesante herramienta</p>

      <a target="_blank" href="http://www.youtube.com/playlist?list=PL38CA7BD8CB5F3FF9">
        <h2>Aprendiendo Node con los v&iacute;deos de VideoTutoriales.com</h2>
      </a>
      <img class="mini" src="img/mini_out.jpg" />
      <h3>Precio: <span>$0</span></h3>
      <p class="p">En los <a target="_blank"  href="http://www.youtube.com/playlist?list=PL38CA7BD8CB5F3FF9">v&iacute;deos de Javascript de la VideoTutoriales.com</a> se explica todo lo b&aacute;sico que necesitas saber sobre Node (Como por ejemplo: que demonios es Node?). Se ense&ntilde;an todo lo que se debe saber para crear e instalar aplicaciones CRUD (En espa&ntilde;ol: crear, leer, actualizar y borrar) en vuestro servidor hechas en Javascript y aprovechando todos los <a target="_blank" href="http://fernetjs.com/2012/02/modulos-en-nodejs/">m&oacute;dulos que existen para Node.JS.</a> Por cierto no os olvid&eacute;is de visitar los otros posts de fernet si Javascript y Node son tu rollo! E igualmente no pases por alto los otros videotutoriales de <a target="_blank" href="http://www.youtube.com/user/0utKast/videos?view=1&flow=list&sort=dd">VideoTutoriales.com en YouTube</a></p>

      
      <a target="_blank" href="http://www.bogotajs.com/">
        <h2>Asistiendo a eventos de Bogota.JS o comunidades similares</h2>
      </a>
      <img class="mini" src="img/mini_bogjs.jpg" />
      <h3>Precio: <span>$0</span></h3>
      <p class="p"><a href="http://www.bogotajs.com/">BogotaJS</a> es un grupo de desarrolladores Javascript y espacio en el que continuamente se exponen nuevas tecnolog&iacute;as y desarrollos relevantes para todo aquel que desee aprender Javascript y estar siempre actualizado de las nuevas posibilidades que este brinda. BogotaJS como su nombre lo indica se lleva a cabo en Bogot&aacute; (Colombia), pero si no vives en Bogot&aacute; o ni siquiera en Colombia haciendo uso del <a target="blank" href="http://www.meetup.com/">buscador de Meetup puedes encontrar conferencias</a> similares en tu ciudad, por ejemplo buscando en Argentina me encontr&eacute; una <a target="_blank" href="http://www.meetup.com/NodeJS-Argentina/">gran comunidad sobre Node.JS</a> y en M&eacute;xico encontr&eacute; una <a href="http://www.meetup.com/TitaniumAppceleratorMX/" target="_blank">comunidad de Titanium</a>.</p>

      <a target="_blank" href="https://www.google.com/?hl=en">
        <h2>Google... es en serio!</h2>
      </a>
      <img class="mini" src="img/mini_g.jpg" />
      <h3>Precio: <span>$0</span></h3>
      <p class="p">Si estas teniendo alg&uacute;n problema en Javascript o en cualquier otro lenguaje tienes que ser inteligente y preciso a la hora de buscar ayuda en Internet; no escribas en el caj&oacute;n de b&uacute;squeda "Nodejs se me bloquea". Mejor mira si el error tiene alg&uacute;n numero, modulo o alguna frase en particular; busca mejor "Nodejs symbol lookup error" u otra informaci&oacute;n que parezca valiosa a la hora de describir el problema de forma t&eacute;cnica. Recuerda siempre que cualquier problema que hayas tenido es muy probable que tambi&eacute;n lo haya tenido alguien mas en Internet; una b&uacute;squeda precisa puede salvarte horas de frustraci&oacute;n. Cabe recalcar que si sabes un poco de ingles a veces es mejor buscar directamente en <a href="http://stackoverflow.com" target="_blank">Stackoverflow</a>, un directorio de preguntas y respuestas sobre cualquier lenguaje de programaci&oacute;n... y claro; si no encuentras soluci&oacute;n a tu problema no dudes en postear tu duda (en ingles!), muchos de los miembro de <a href="http://stackoverflow.com" target="_blank">Stackoverflow</a> estar&aacute;n dispuestos a ayudarte.</p>
      
      <a target="_blank" href="http://www.youtube.com/course?list=EC46F0A159EC02DF82">
        <h2>Para quienes saben ingles los recursos son casi infinitos!</h2>
      </a>
      <img class="mini" src="img/mini_en.jpg" />
      <h3>Precio: <span>$0</span></h3>
      <p class="p">Si tienes la fortuna de saber Ingles <a target="_blank" href="http://www.youtube.com/course?list=EC46F0A159EC02DF82">el canal de TheNewBoston</a> tiene unos excelentes v&iacute;deos donde explica lenta y claramente los componentes en Javascript ense&ntilde;ando desde lo mas b&aacute;sico como declaraci&oacute;n de variables hasta cosas como validaci&oacute;n de formularios. Igualmente luego de que domines un poco Javascript deber&iacute;as acceder a su <a href="http://www.youtube.com/course?list=EC6B08BAA57B5C7810">curso de jQuery</a>. Cuando ya estes un poco mas c&oacute;modo con Javascript puedes acceder a las (sin exagerar) miles de colecciones de <a href="https://gist.github.com/LindseyB/5015434" target="_blank">tutoriales para Node.JS</a>; igualmente no puedo hablar de material en ingles sin recomendar <a target="_blank" href="http://eloquentjavascript.net/">"Eloquent Javascript"</a> que es un libro gratuito y muy completo sobre Javascript.</p>

      <a target="_blank" href="http://www.youtube.com/playlist?list=PLp-77SLGy08yNQ58XClTU31IcGVO7CC9s">
        <h2>Por cierto, si no sabes ingles... learn it!</h2>
      </a>
      <img class="mini" src="img/mini_en2.jpg" />
      <h3>Precio: <span>$0</span></h3>
      <p class="p">No es directamente relacionado con Javascript pero as&iacute; nos guste o no el ingles es el idioma de Internet; es la lengua mas hablada del mundo y teniendo en cuenta que Javascript y Node fueron creados en Estados Unidos es entendible que la mayor cantidad de v&iacute;deos y textos sobre estas tecnolog&iacute;as est&eacute;n en ingles; es por eso y por muchas otras razones que aprender Ingles es una de las mejoras formas en que invertir tu tiempo. Tal vez no lo sepas pero estructuralmente hablando el espa&ntilde;ol es mucho mas dif&iacute;cil que el ingles. As&iacute; que aprovecha el tiempo, <a href="http://www.youtube.com/playlist?list=PLp-77SLGy08yNQ58XClTU31IcGVO7CC9s">puedes comenzar checando estos v&iacute;deos!</a></p>

      <footer>
      <hr>
        <p>Creado por <a class="author" href="http://twitter.com/ivanca">Iv&aacute;n Castellanos</a><br>El logo animado en este sitio web es una parodia de mejorando.la<br>
          <span title="Copyright (c) 2012 Ivan Castellanos.

Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the 'Software'), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED 'AS IS', WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.">MIT License</span>

        <a href="https://github.com/AltIvan/programando.la">Fork it on github</a></p>
      </footer>

    </div>

    <div id="myModal" class="modal hide fade in" tabindex="-1" role="dialog" aria-labelledby="myModalLabel" aria-hidden="false">
      <div class="modal-header">
        <button type="button" class="close" data-dismiss="modal" aria-hidden="true">×</button>
        <h3 id="myModalLabel">Contribuir un link</h3>
      </div>
      <div class="modal-body">
    <form id="link-form" action="save_url.php" method="post">

      <fieldset>
        <label >Titulo:*</label>
        <input type="text" name="name" id="name" placeholder="Escriba un titulo descriptivo." class="large-input" />

        <label >Link:*</label>
        <input type="text" name="link" id="link" placeholder="Ingrese la URL del documento o video" class="large-input" />

        <label >Twitter:</label>
        <input type="text" name="twitter" id="twitter" placeholder="Opcional"  maxlength="20" /> 
        
        <input type="hidden" name="lang" id="lang" /> 
        <button type="submit" class="btn submit-link">Submit</button>
      </fieldset>

    </form>
    </div>
      <script src="//ajax.googleapis.com/ajax/libs/jquery/1.8.3/jquery.min.js"></script>
      <script src="js/jquery.qtip-1.0.0-rc3.min.js"></script> 
      <script type="text/javascript">
      $(".home").qtip({
        style: {
          name: 'light',
          tip: true,
          color: '#BBB',
          fontWeight: 'bold'}, 
        position: { 
          corner: {
            target: 'rightMiddle',
            tooltip: 'leftMiddle'
          },
        adjust: { 
          screen: true
        }}});
      </script>
          
    </div>

  </body>
</html>